Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraintData.LocalCoordinateSystem Property
 The local coordinate system.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisLocalCoordinateSystem LocalCoordinateSystem { get; set; }
Public Property LocalCoordinateSystem As AnalysisLocalCoordinateSystem
	Get
	Set
Property Value
Type: AnalysisLocalCoordinateSystem
See Also
Reference
AnalysisRestraintData Class
Tekla.Structures.Analysis Namespace